<a href="https://colab.research.google.com/github/ValFerreiraAlv/coleta-dados-ipca/blob/main/Coleta_Dados_IPCA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Encontrar a série histórica relativa à inflação (IPCA) na plataforma de dados abertos do BC, importá-la e transformá-la em um DataFrame do Pandas.**

In [ ]:
import pandas as pd

In [ ]:
#Índice nacional de preços ao consumidor-Amplo (IPCA) - Preços monitorados - Avião      #api sgs bcb
url = 'http://api.bcb.gov.br/dados/serie/bcdata.sgs.4456/dados?formato=json'

In [ ]:
df = pd.read_json(url)

In [ ]:
df

           data  valor
0    01/01/1992  11.60
1    01/02/1992  33.58
2    01/03/1992  28.39
3    01/04/1992  22.00
4    01/05/1992  18.85
..          ...    ...
235  01/08/2011  -5.95
236  01/09/2011  23.40
237  01/10/2011  14.26
238  01/11/2011   3.91
239  01/12/2011  -2.05

[240 rows x 2 columns]